# 1) Создать переменную типа String
# 2) Создать переменную типа Integer
# 3) Создать переменную типа Float
# 4) Создать переменную типа Bytes
# 5) Создать переменную типа List
# 6) Создать переменную типа Tuple
# 7) Создать переменную типа Set
# 8. Создать переменную типа Frozen set
# 9) Создать переменную типа Dict
a1_string = 'Hello World'
a2_int = 10
a3_float = 10.5
a5_list = [1, 2, 3]
a6_tuple = (1, 2, 3)
a7_set = set ('Alex')
a8_frozenset = frozenset('Alex')
a9_dict = {'dict1': 1, 'name': 'Alex', 'age': 20}
# 10) Вывести в консоль все выше перечисленные переменные
# с добавлением типа данных.
print('Type is String:', a1_string)
print('Type is Integer:', a2_int)
print('Type is Float:', a3_float)
print('Type is List:', a5_list)
print('Type is Tuple:', a6_tuple)
print('Type is Set:', a7_set)
print('Type is Frozenset:', a8_frozenset)
print('Type is Dict:', a9_dict)
# 11) Создать 2 переменные String, создать переменную в
# которой суммируете эти переменные. Вывести в консоль.
str1 = 'Hello'
str2 = 'World'
res = str1 + str2
print(res)
# 12) Создать 2 переменные Integer, создать переменную в которой
# суммируете эти переменные. Вывести в консоль.
int1 = 10
int2 = 4
res2 = int1 + int2
print(res2)
# 13) Создать переменную в которой Разделите эти переменные Int.
#     Вывести в консоль.
res3 = int1 / int2
print(res3)
# 14) Создать переменную в которой Умножите эти переменные Int.
#     Вывести в консоль.
res4 = int1 * int2
print(res4)
# 15) Создать переменную в которой Разделите без остатка эти переменные Int.
#     Вывести в консоль.
res5 = int1 // int2
print(res5)
# 16) Создать переменную в которой надо присвоить остаток от деления этих переменные Int.
#     Вывести в консоль.
res6 = int1 % int2
print(res6)





